"""
作者：Big_hunzi
日期：2021年11月04日   18:57

主题：格式化字符串
"""

#格式化字符串的两种方式  %          {}.format

#1 %作占位符 %s字符串，%i或%d整数，%f浮点数
name='张三'
age=20
print('我叫%s,今年%d岁' %(name,age))


#2 {}作占位符
print('我叫{0},今年{1}岁，我真的叫{0}'.format(name,age))

#f-string
print(f'我叫{name},今年{age}岁')


print('%10d' % 99)#10表示的是宽度
print('%10d' % 123456789123456789)

print('%f' % 3.1415926)
print('%.3f' % 3.1415926)#.3表示的是精度，表示小数点后三位

#可以同时表示宽度和精度
print('%10.3f' % 3.1415926)#总宽度为10，小数点后三位

print('{0}'.format(3.1415926))
print('{:.3}'.format(3.1415926))#.3表示的是一共是3位数
print('{:.3f}'.format(3.1415926))#.3f表示的是3位小数

print('{:10.3f}'.format(3.1415926))#同时设置宽度和精度

